samples/openfoam_case/0/omega
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}

dimensions      [0 0 -1 0 0 0 0];
internalField   uniform 1;
boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 1;
    }
    farfield
    {
        type            fixedValue;
        value           uniform 1;
    }
    aircraft
    {
        type            omegaWallFunction;
        value           uniform 1;
    }
    "aircraft.*"
    {
        type            omegaWallFunction;
        value           uniform 1;
    }
}
