samples/openfoam_case/system/createPatchDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

pointSync false;

patches
(
    {
        name aircraft;
        patchInfo
        {
            type wall;
            inGroups (wall);
        }
        constructFrom patches;
        patches ("aircraft_.*");
    }
);
